/* ------------------------------------------------------------------------- */
/*                                                                           */
/* １０万件ソート                                                            */
/*                                                                           */
/* ------------------------------------------------------------------------- */
/*  番号    更新内容                                更新日      名前         */
/* ------------------------------------------------------------------------- */
/* 000000   新規作成                                2019/07/07  西岡  和輝   */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* includeファイル                                                           */
/* ------------------------------------------------------------------------- */

#include "LogChecker.h"

/* ------------------------------------------------------------------------- */
/* 定数定義	                                                                 */
/* ------------------------------------------------------------------------- */


/* ------------------------------------------------------------------------- */
/* 構造体定義                                                                */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* グローバル変数                                                            */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* プロトタイプ宣言                                                          */
/* ------------------------------------------------------------------------- */
SCHR LogChecker( SCHR , const char *, ... );

SCHR LogChecker( SCHR scLogType , const char * Message , ... ) {

    if ( Message == NULL ) { return LC_PARAM; }

    /* 変数宣言 ------------------------------------------------------------ */
    SCHR    scStr[256];							/* 可変長文字列格納用		 */
    va_list args;								/* 可変長引数処理用			 */

    memset( scStr, 0, sizeof( scStr ));

    va_start( args, Message );					/* 可変長引数処理開始		  */
	vsprintf( scStr, Message, args );			/* 可変長引数取得			  */
	va_end( args );								/* 可変長引数処理終了 		  */

/* printfの内容と関数名は適当 */
    switch ( scLogType ) {

#ifdef _DEBUG

#ifdef NORMALLOG_DEFINE
    case NORMALLOG:
        printf( "通常モード　　:" );
        Normal( scStr );
        break;
#endif

#ifdef TRACELOG_DEFINE
    case TRACELOG:
        printf( "トレースモード:" );
        Trace ( scStr );
#endif

#ifdef PERFORMANCELOG_DEFINE
    case PERFORMANCELOG:
        printf( "タイム:" );
        Perform( );
        break;
#endif
#endif

#ifdef ERRERLOG_DEFINE
    case ERRERLOG:
        printf( "エラーモード　:" );
        Normal( scStr );
        break;
#endif

    default:
        return LC_PARAM;
    }

    return LC_OK;

}


/* ------------------------------------------------------------------------- */
/*              Copyright HAL Collage of Technology & Design                 */
/* ------------------------------------------------------------------------- */